tap "nikitabobko/tap", trusted: true
tap "oven-sh/bun", trusted: true
tap "shopify/shopify", trusted: true
tap "supabase/tap", trusted: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Postgres development platform
brew "supabase"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Anthropic's official Claude AI desktop app
cask "claude"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Voice and text chat software
cask "discord"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Keyboard customiser
cask "karabiner-elements"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Dictation tool including LLM reformatting
cask "superwhisper"
# To-do & task list manager
cask "ticktick"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
npm "corepack"
npm "pnpm"
npm "typescript-language-server"
npm "typescript"
